#Задание номер 1
num = [6,27,11,10,7,9]
sum = 0
ave = 0

for i in num:
    sum += i
    
average = sum / len(num)
print("Cумма: ", sum)
print("Среднее значение: ", ave)
print("==================================================================")

#Задание номер 2
corteg = ("Александра","Евгений","Елизавета","Анастасия","Федор")
for people in corteg:
    print(("ТОО 'Свежий воздух', имя сотрудника: "), people)
print("=================================================================")

#Задание номер 3
corteg2 = ["Александра","Евгений","Елизавета","Анастасия","Федор"]
fedya=input("Введите имя сотрудника: ")
if fedya == "Федор":
    del corteg2[0]
    print("Данный сотрудник был удалён из базы!")
else:
    print("Сотрудник не был удалён так как его нет в базе!")
print(corteg2)
print("==================================================================")

#Задание номер 4
fruits = ["Гранат","Яблоко","Апельсин","Папайа","Банан","Грейпфрукт"]
for a in fruits:
    if len(a)<6:
        fruits.remove(a)
        
print(fruits)
print("==================================================================")

#Задание номер 5
stud = [("Елизавета",95), ("Мадияр", 65),("Евгений", 90),("Александра", 63)]
print(stud[0])
print(stud[1])
print(stud[2])
print(stud[3])
print("==================================================================")

#Задание номер 6
numbers = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,15,16,17,18,19,20]
for i in numbers:
    if i%2==0:
        print(i)
print("==================================================================")

#Задание номер 7
number =list(range(0,20,1))
a = 0
for num in number:
    a = a + num **2
print("Сумма квадратов всех чисел: " + str(a))
print("==================================================================")
