#Задание 4 Карточка пользователя

name = input("Введите ваше имя:")
sname = input("Введите вашу фамилию: ")
age = int (input("Введите ваш возраст:"))
numb = int (input("Введите ваш номер:"))
city = input("Введите город проживания:")
email = input("Введите ваш электронный адрес:")
print("********************************************************************")
print ("Имя: ",name, '\n' "Фамилия:", sname, '\n' "Возраст:", age, '\n' "Номер телефона:", numb, '\n' "Город проживания:", city, '\n' "E-mail:", email)
print("********************************************************************")